app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-03-02 05:01:48.191367"], ["updated_at", "2021-03-02 05:01:48.191367"]]
---
  def create
    @book = Book.find(params[:book_id])
    @book_comment = current_user.book_comments.new(book_comment_params)
    @book_comment.book_id = @book.id
    if @book_comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 7]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 7], ["book_id", 8], ["LIMIT", 1]]
---
  def destroy
    flash[:notice]="Comment was successfully destroyed."
    @book_comment = BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy